Revit 2026 API

# HubGetOrigin Method

---

Retrieves position of a Hub if such position is a 3D point.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ GetOrigin()
```
```vb
Public Function GetOrigin As XYZ
```
```cpp
public:
XYZ^ GetOrigin()
```
```fsharp
member GetOrigin : unit -> XYZ
```

#### Return Value

XYZ The origin.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Hub does not have an Origin. |

#### Reference

Hub Class

Autodesk.Revit.DB.Structure Namespace